In [392]:
import pandas
zam_liberec = pandas.read_csv("ukol_10_zam_liberec.csv")
zam_liberec["mesto"] = "Liberec"
zam_praha = pandas.read_csv("ukol_10_zam_praha.csv")
zam_praha["mesto"] = "Praha"
zam_plzen = pandas.read_csv("ukol_10_zam_plzeň.csv")
zam_plzen["mesto"] = "Plzeň"

In [393]:
zam_liberec.head()

       jmeno    prijimeni   telefonni_cislo  cislo_zamestnance    mesto
0       Nela      Šťastná       728 454 176                 83  Liberec
1    Heather      Marková       604 404 522                 84  Liberec
2     Krista  Procházková  +421 50 444 5544                 85  Liberec
3   Jennifer        Brown       775 545 190                 86  Liberec
4  Ladislava    Blackwell  +421 913 487 200                 87  Liberec

In [394]:
zamestnanci = pandas.concat([zam_plzen, zam_praha, zam_liberec])
zamestnanci.info()

<class 'pandas.core.frame.DataFrame'>
Index: 56 entries, 0 to 10
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              56 non-null     object
 1   prijimeni          56 non-null     object
 2   telefonni_cislo    56 non-null     object
 3   cislo_zamestnance  56 non-null     int64
 4   mesto              56 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.6+ KB

In [395]:
platy = pandas.read_csv("ukol_10_platy_2021_02.csv")

In [396]:
platy_a_zamestnanci = pandas.merge(platy, zamestnanci, on="cislo_zamestnance")
platy_a_zamestnanci.shape

(43, 6)

In [397]:
print(f"{zamestnanci.shape=}")
print(f"{platy.shape=}")
print(f"{platy_a_zamestnanci.shape=}")

zamestnanci.shape=(56, 5)
platy.shape=(43, 2)
platy_a_zamestnanci.shape=(43, 6)

In [398]:
platy_a_zamestnanci.groupby("mesto")["plat"].mean()

mesto
Liberec    43775.000000
Plzeň      44792.857143
Praha      43295.238095
Name: plat, dtype: float64

# část 2:

In [399]:
vykazy = pandas.read_csv("ukol_10_vykazy.csv")
vykazy.head()

         date  hours project  emloyee_id
0  2021-02-01    2.5     F30          13
1  2021-02-01    3.4     W05          70
2  2021-02-01    2.1     JL9          72
3  2021-02-01    5.2     F30           3
4  2021-02-01    2.4     TE1          54

In [400]:
vykazy.groupby("project")["hours"].sum()

project
F30    21.5
JL9     2.1
TE1    16.0
W05    30.5
YLI    31.0
Name: hours, dtype: float64